import time
DESTINATION_DATA = {
    # Турция
    "Стамбул": {
        "Лето": {
            "temp": "25-35°C",
            "description": "Жарко и влажно, много туристов.",
            "tips": ["Легкая одежда", "Солнцезащитный крем", "Головной убор"]
        },
        "Зима": {
            "temp": "5-10°C",
            "description": "Прохладно, возможны дожди и ветер.",
            "tips": ["Демисезонная куртка", "Зонт", "Теплый свитер"]
        },
        "Весна": {
            "temp": "15-22°C",
            "description": "Комфортно, цветущие парки, мало туристов.",
            "tips": ["Легкая куртка", "Удобная обувь", "Солнцезащитные очки"]
        },
        "Осень": {
            "temp": "18-25°C",
            "description": "Тепло, приятно для экскурсий.",
            "tips": ["Джинсы и кофта", "Зонт на случай дождя", "Удобные кроссовки"]
        }
    },
    "Анталия": {
        "Лето": {
            "temp": "28-38°C",
            "description": "Очень жарко, сухо, пляжный сезон.",
            "tips": ["Купальник", "Солнцезащитный крем", "Панама"]
        },
        "Зима": {
            "temp": "10-15°C",
            "description": "Мягко, возможны дожди, мало туристов.",
            "tips": ["Легкая куртка", "Джинсы", "Зонт"]
        },
        "Весна": {
            "temp": "18-25°C",
            "description": "Тепло, море еще прохладное.",
            "tips": ["Легкие брюки", "Футболки", "Сандалии"]
        },
        "Осень": {
            "temp": "20-28°C",
            "description": "Тепло, море комфортное, бархатный сезон.",
            "tips": ["Пляжная одежда", "Легкий кардиган", "Солнцезащитные очки"]
        }

    },
    # Италия
    "Рим": {
        "Лето": {
            "temp": "25-35°C",
            "description": "Жарко, много туристов, сухо.",
            "tips": ["Шляпа", "Солнцезащитный крем", "Бутылка воды"]
        },
        "Зима": {
            "temp": "5-12°C",
            "description": "Прохладно, возможны дожди.",
            "tips": ["Пальто", "Зонт", "Шарф"]
        },
        "Весна": {
            "temp": "15-22°C",
            "description": "Идеально для экскурсий, цветущие сады.",
            "tips": ["Легкая куртка", "Удобная обувь", "Солнцезащитные очки"]
        },
        "Осень": {
            "temp": "12-20°C",
            "description": "Тепло, мало туристов, красивые закаты.",
            "tips": ["Джинсы", "Свитер", "Зонт на случай дождя"]
        }
    },
    "Венеция": {
        "Лето": {
            "temp": "23-30°C",
            "description": "Жарко, влажно, возможны наводнения.",
            "tips": ["Легкая одежда", "Солнцезащитный крем", "Удобная обувь"]
        },
        "Зима": {
            "temp": "0-8°C",
            "description": "Холодно, туманно, романтичная атмосфера.",
            "tips": ["Теплое пальто", "Шарф", "Водонепроницаемая обувь"]
        },
        "Весна": {
            "temp": "12-20°C",
            "description": "Комфортно, меньше туристов, приятные прогулки.",
            "tips": ["Легкий свитер", "Джинсы", "Зонт"]
        },
        "Осень": {
            "temp": "10-18°C",
            "description": "Прохладно, возможны дожди, уютная атмосфера.",
            "tips": ["Куртка", "Шарф", "Удобные ботинки"]
        }
    },

    # Испания
    "Барселона": {
        "Лето": {
            "temp": "25-32°C",
            "description": "Жарко, сухо, пляжный сезон.",
            "tips": ["Купальник", "Солнцезащитный крем", "Шляпа"]
        },
        "Зима": {
            "temp": "8-15°C",
            "description": "Мягко, возможны дожди.",
            "tips": ["Легкая куртка", "Джинсы", "Зонт"]
        },
        "Весна": {
            "temp": "15-22°C",
            "description": "Тепло, комфортно для прогулок.",
            "tips": ["Футболки", "Легкая куртка", "Сандалии"]
        },
        "Осень": {
            "temp": "18-25°C",
            "description": "Тепло, море еще приятное, бархатный сезон.",
            "tips": ["Легкие вещи", "Кардиган", "Солнцезащитные очки"]
        }
    },
    "Мадрид": {
        "Лето": {
            "temp": "28-38°C",
            "description": "Очень жарко, сухо, мало осадков.",
            "tips": ["Легкая одежда", "Головной убор", "Вода"]
        },
        "Зима": {
            "temp": "2-10°C",
            "description": "Холодно, возможен снег.",
            "tips": ["Теплая куртка", "Шарф", "Перчатки"]
        },
        "Весна": {
            "temp": "15-25°C",
            "description": "Тепло, цветущие парки.",
            "tips": ["Легкие вещи", "Солнцезащитные очки", "Удобная обувь"]
        },
        "Осень": {
            "temp": "10-20°C",
            "description": "Прохладно, приятно для экскурсий.",
            "tips": ["Джинсы", "Свитер", "Легкая куртка"]
        }
    },
   # Дополнительные города
    "Прага": {
        "Лето": {
            "temp": "18-26°C",
            "description": "Тепло, много фестивалей.",
            "tips": ["Легкая одежда", "Зонт", "Удобная обувь"]
        },
        "Зима": {
            "temp": "-3 - +3°C",
            "description": "Холодно, возможен снег, рождественские ярмарки.",
            "tips": ["Теплая куртка", "Шапка", "Термобелье"]
        },
        "Весна": {
            "temp": "8-16°C",
            "description": "Прохладно, цветущие сады.",
            "tips": ["Демисезонная куртка", "Зонт", "Шарф"]
        },
        "Осень": {
            "temp": "5-14°C",
            "description": "Прохладно, золотая осень.",
            "tips": ["Теплый свитер", "Ветровка", "Удобные ботинки"]
        }
    },
    "Амстердам": {
        "Лето": {
            "temp": "17-22°C",
            "description": "Тепло, возможны дожди.",
            "tips": ["Дождевик", "Удобная обувь", "Свитер"]
        },
        "Зима": {
            "temp": "0-6°C",
            "description": "Холодно, ветрено, возможен снег.",
            "tips": ["Теплая куртка", "Шарф", "Перчатки"]
        },
        "Весна": {
            "temp": "8-15°C",
            "description": "Цветут тюльпаны, прохладно.",
            "tips": ["Легкая куртка", "Зонт", "Удобные кроссовки"]
        },
        "Осень": {
            "temp": "7-14°C",
            "description": "Дождливо, уютная атмосфера.",
            "tips": ["Ветровка", "Зонт", "Теплый шарф"]
        }
    },

    # Таиланд
    "Бангкок": {
        "Лето": {
            "temp": "28-35°C",
            "description": "Жарко и влажно, сезон дождей (июль-октябрь).",
            "tips": ["Дождевик", "Быстросохнущая одежда", "Сандалии"]
        },
        "Зима": {
            "temp": "25-32°C",
            "description": "Сухой сезон — идеально для экскурсий.",
            "tips": ["Шорты", "Солнцезащитный крем", "Шляпа"]
        },
        "Весна": {
            "temp": "30-38°C",
            "description": "Пик жары, фестиваль Сонгкран (апрель).",
            "tips": ["Водонепроницаемый чехол для телефона", "Купальник", "Очки"]
        },
        "Осень": {
            "temp": "27-33°C",
            "description": "Переход к сезону дождей, влажно.",
            "tips": ["Зонт", "Репеллент", "Легкий кардиган"]
        }
    },
    "Пхукет": {
        "Лето": {
            "temp": "27-32°C",
            "description": "Частые дожди, но тепло. Низкий сезон.",
            "tips": ["Дождевик", "Пляжная обувь", "Водонепроницаемый рюкзак"]
        },
        "Зима": {
            "temp": "24-30°C",
            "description": "Сухо и солнечно — высокий сезон.",
            "tips": ["Пляжная одежда", "Солнцезащитный крем SPF 50+", "Полотенце"]
        },
        "Весна": {
            "temp": "28-35°C",
            "description": "Жарко, возможны кратковременные ливни.",
            "tips": ["Головной убор", "УФ-защитная одежда", "Бутылка воды"]
        },
        "Осень": {
            "temp": "26-32°C",
            "description": "Влажно, море теплое, мало туристов.",
            "tips": ["Солнцезащитные очки", "Легкий свитер для вечера", "Зонт"]
        }
    },
        # Вьетнам
    "Ханой": {
            "Лето": {
                "temp": "28-38°C",
                "description": "Жарко и влажно, ливни (май-сентябрь).",
                "tips": ["Зонт", "Ветровка от дождя", "Вентилятор"]
            },
            "Зима": {
                "temp": "15-20°C",
                "description": "Прохладно, туманно, сухо (декабрь-февраль).",
                "tips": ["Джинсы", "Тонкий шарф", "Кроссовки"]
            },
            "Весна": {
                "temp": "20-28°C",
                "description": "Цветение персиков, комфортная погода.",
                "tips": ["Легкая куртка", "Удобная обувь", "Фотоаппарат"]
            },
            "Осень": {
                "temp": "22-30°C",
                "description": "Тепло, возможны тайфуны (октябрь).",
                "tips": ["Дождевик", "Закрытая обувь", "Аптечка"]
            }
     },
    "Хошимин": {
            "Лето": {
                "temp": "25-35°C",
                "description": "Влажно, ежедневные кратковременные дожди.",
                "tips": ["Быстросохнущая одежда", "Репеллент", "Сланцы"]
            },
            "Зима": {
                "temp": "22-30°C",
                "description": "Сухо и солнечно — лучшее время для поездки.",
                "tips": ["Футболки", "Шляпа", "Солнцезащитный крем"]
            },
            "Весна": {
                "temp": "28-35°C",
                "description": "Жарко, высокая влажность.",
                "tips": ["Влажные салфетки", "Бутылка воды", "Кепка"]
            },
            "Осень": {
                "temp": "25-32°C",
                "description": "Дожди реже, но возможны тайфуны.",
                "tips": ["Зонт", "Легкий плащ", "Телефон в чехле"]
            }
    },

   # Россия
    "Москва": {
            "Лето": {
                "temp": "18-25°C",
                "description": "Тепло, возможны дожди. Идеально для прогулок по городу.",
                "tips": ["Зонт", "Удобная обувь", "Легкая куртка"]
            },
            "Зима": {
                "temp": "-10 - -20°C",
                "description": "Холодно, снег. Новогодняя атмосфера.",
                "tips": ["Теплая одежда", "Шапка и перчатки", "Нескользящая обувь"]
            },
            "Весна": {
                "temp": "5-15°C",
                "description": "Переменчивая погода, возможны заморозки и дожди.",
                "tips": ["Демисезонная куртка", "Зонт", "Водонепроницаемая обувь"]
            },
            "Осень": {
                "temp": "5-12°C",
                "description": "Прохладно, дожди, золотая осень в парках.",
                "tips": ["Теплый свитер", "Ветровка", "Зонт"]
            }
        },
    "Санкт-Петербург": {
            "Лето": {
                "temp": "15-22°C",
                "description": "Белые ночи (июнь-июль). Часто дожди.",
                "tips": ["Зонт", "Теплый свитер", "Непромокаемая обувь"]
            },
            "Зима": {
                "temp": "-5 - -15°C",
                "description": "Снежно, влажно, возможны метели.",
                "tips": ["Термобелье", "Пуховик", "Шапка и шарф"]
            },
            "Весна": {
                "temp": "0-10°C",
                "description": "Слякоть, частые дожди, прохладно.",
                "tips": ["Резиновые сапоги", "Дождевик", "Теплый шарф"]
            },
            "Осень": {
                "temp": "5-12°C",
                "description": "Туманно, дождливо, красивые пейзажи.",
                "tips": ["Ветровка", "Зонт", "Теплые носки"]
            }
        },
        # Китай
    "Пекин": {
            "Лето": {
                "temp": "25-35°C",
                "description": "Жарко, возможны песчаные бури.",
                "tips": ["Марлевая повязка", "Солнцезащитные очки", "Вода"]
            },
            "Зима": {
                "temp": "-10 - +5°C",
                "description": "Холодно, сухо, возможен снег.",
                "tips": ["Пуховик", "Термобелье", "Шапка"]
            },
            "Весна": {
                "temp": "10-20°C",
                "description": "Цветение садов, возможны ветра.",
                "tips": ["Ветровка", "Шарф", "Удобная обувь"]
            },
            "Осень": {
                "temp": "8-18°C",
                "description": "Золотая осень, прохладно.",
                "tips": ["Демисезонная куртка", "Зонт", "Фотоаппарат"]
            }
        },
    "Шанхай": {
            "Лето": {
                "temp": "25-35°C",
                "description": "Жарко и влажно, частые дожди.",
                "tips": ["Зонт", "Вентилятор", "Легкая одежда"]
            },
            "Зима": {
                "temp": "0-8°C",
                "description": "Холодно, сыро, возможен снег.",
                "tips": ["Теплая куртка", "Шарф", "Водонепроницаемая обувь"]
            },
            "Весна": {
                "temp": "12-22°C",
                "description": "Цветение вишни, комфортно.",
                "tips": ["Легкий свитер", "Зонт", "Кроссовки"]
            },
            "Осень": {
                "temp": "15-25°C",
                "description": "Тепло, мало осадков.",
                "tips": ["Ветровка", "Солнцезащитные очки", "Удобная обувь"]
            }
        },
    # Франция
    "Париж": {
        "Лето": {
            "temp": "15-25°C",
            "description": "Тепло, возможны дожди, много туристов.",
            "tips": ["Легкая куртка", "Зонт", "Удобные кроссовки"]
        },
        "Зима": {
            "temp": "0-8°C",
            "description": "Холодно, сыро, рождественская атмосфера.",
            "tips": ["Пальто", "Шарф", "Теплые сапоги"]
        },
        "Весна": {
            "temp": "10-18°C",
            "description": "Цветущие каштаны, комфортно.",
            "tips": ["Джинсы", "Легкий свитер", "Зонт"]
        },
        "Осень": {
            "temp": "8-16°C",
            "description": "Дожди, уютные кафе, мало туристов.",
            "tips": ["Плащ", "Шарф", "Фотоаппарат"]
        }
    },

        # Япония
    "Токио": {
            "Лето": {
                "temp": "25-35°C",
                "description": "Жарко и влажно, сезон дождей (июнь).",
                "tips": ["Зонт", "Вентилятор", "Полотенце для пота"]
            },
            "Зима": {
                "temp": "0-10°C",
                "description": "Сухо, возможен снег, новогодние украшения.",
                "tips": ["Пуховик", "Шапка", "Термобелье"]
            },
            "Весна": {
                "temp": "10-20°C",
                "description": "Цветение сакуры (март-апрель).",
                "tips": ["Удобная обувь", "Фотоаппарат", "Легкая куртка"]
            },
            "Осень": {
                "temp": "15-23°C",
                "description": "Красные клены (ноябрь), комфортно.",
                "tips": ["Джинсы", "Свитер", "Зонт на случай дождя"]
            }
        },

        # Великобритания
    "Лондон": {
            "Лето": {
                "temp": "15-25°C",
                "description": "Тепло, но дожди возможны в любое время.",
                "tips": ["Дождевик", "Свитер", "Удобные ботинки"]
            },
            "Зима": {
                "temp": "2-8°C",
                "description": "Холодно, сыро, туманы.",
                "tips": ["Теплое пальто", "Шарф", "Зонт"]
            },
            "Весна": {
                "temp": "8-15°C",
                "description": "Цветение парков, переменчивая погода.",
                "tips": ["Демисезонная куртка", "Резиновые сапоги", "Шарф"]
            },
            "Осень": {
                "temp": "7-14°C",
                "description": "Дожди, золотая листва.",
                "tips": ["Водонепроницаемая обувь", "Плащ", "Теплые носки"]
            }
        },
        # Азербайджан
    "Баку": {
            "Лето": {
                "temp": "25-35°C",
                "description": "Жарко и сухо, ветер «Хази».",
                "tips": ["Головной убор", "Солнцезащитный крем", "Бутылка воды"]
            },
            "Зима": {
                "temp": "0-10°C",
                "description": "Мягкая зима, но ветрено.",
                "tips": ["Куртка", "Шарф", "Удобные ботинки"]
            },
            "Весна": {
                "temp": "12-22°C",
                "description": "Тепло, цветение миндаля.",
                "tips": ["Легкая куртка", "Солнцезащитные очки", "Удобная обувь"]
            },
            "Осень": {
                "temp": "15-25°C",
                "description": "Комфортно, сухо, мало туристов.",
                "tips": ["Ветровка", "Шарф", "Фотоаппарат"]
            }
        },

    # ОАЭ
    "Дубай": {
        "Лето": {
            "temp": "35-45°C",
            "description": "Экстремальная жара, кондиционеры везде.",
            "tips": ["Легкая одежда", "Очки", "Бутылка воды"]
        },
        "Зима": {
            "temp": "20-28°C",
            "description": "Идеальная погода для экскурсий.",
            "tips": ["Кардиган", "Шарф для мечетей", "Сандалии"]
        },
        "Весна": {
            "temp": "25-35°C",
            "description": "Тепло, возможны песчаные бури.",
            "tips": ["Марлевая повязка", "Головной убор", "Солнцезащитный крем"]
        },
        "Осень": {
            "temp": "28-38°C",
            "description": "Жарко, но менее экстремально, чем летом.",
            "tips": ["Зонт от солнца", "Увлажняющий крем", "Легкая накидка"]
        }
    },

        # Германия (дополнение)
    "Берлин": {
            "Лето": {
                "temp": "18-25°C",
                "description": "Тепло, много фестивалей под открытым небом.",
                "tips": ["Дождевик", "Солнцезащитный крем", "Велосипед"]
            },
            "Зима": {
                "temp": "-3 - +5°C",
                "description": "Холодно, рождественские рынки, возможен снег.",
                "tips": ["Пуховик", "Термобелье", "Шапка"]
            },
            "Весна": {
                "temp": "8-16°C",
                "description": "Цветение парков, переменчивая погода.",
                "tips": ["Демисезонная куртка", "Зонт", "Шарф"]
            },
            "Осень": {
                "temp": "5-14°C",
                "description": "Дожди, золотая листва, уютные кафе.",
                "tips": ["Водонепроницаемая обувь", "Теплый свитер", "Зонт"]
            }
        },
    "Гамбург": {
            "Лето": {
                "temp": "17-22°C",
                "description": "Тепло, но ветрено из-за близости к морю.",
                "tips": ["Ветровка", "Удобная обувь", "Солнцезащитные очки"]
            },
            "Зима": {
                "temp": "-1 - +4°C",
                "description": "Сыро, туманы, редкий снег.",
                "tips": ["Теплая куртка", "Шарф", "Водонепроницаемые ботинки"]
            },
            "Весна": {
                "temp": "7-15°C",
                "description": "Прохладно, цветение каштанов.",
                "tips": ["Легкая куртка", "Зонт", "Перчатки"]
            },
            "Осень": {
                "temp": "6-13°C",
                "description": "Дожди, сильные ветра.",
                "tips": ["Плащ", "Шапка", "Теплые носки"]
            }
        },
    "Мюнхен": {
            "Лето": {
                "temp": "18-25°C",
                "description": "Тепло, Октоберфест (сентябрь).",
                "tips": ["Кожаные штаны/платье", "Удобная обувь", "Дождевик"]
            },
            "Зима": {
                "temp": "-5 - +5°C",
                "description": "Снег, рождественские ярмарки.",
                "tips": ["Пуховик", "Варежки", "Термобелье"]
            },
            "Весна": {
                "temp": "8-17°C",
                "description": "Альпийские луга цветут.",
                "tips": ["Легкая куртка", "Треккинговые ботинки", "Фотоаппарат"]
            },
            "Осень": {
                "temp": "5-14°C",
                "description": "Золотая осень в парках.",
                "tips": ["Джинсы", "Ветровка", "Шарф"]
            }
        },

    "Белград": {
        "Осень": {
            "temp": "12-20°C",
            "description": "Мягкая погода, мало туристов.",
            "tips": ["Легкий свитер", "Фотоаппарат", "Удобная обувь"]
        }
    },

    # Африка Марокко
    "Марракеш (Марокко)": {
            "Лето": {
                "temp": "30-45°C",
                "description": "Экстремальная жара, сухо.",
                "tips": ["Хлопковая одежда", "Тюрбан", "Солнцезащитный крем SPF 50+"]
            },
            "Зима": {
                "temp": "8-20°C",
                "description": "Прохладно ночью, комфортно днем.",
                "tips": ["Легкая куртка", "Шарф", "Закрытая обувь"]
            },
            "Весна": {
                "temp": "18-28°C",
                "description": "Идеально для экскурсий, цветение оазисов.",
                "tips": ["Солнцезащитные очки", "Панама", "Бутылка воды"]
            },
            "Осень": {
                "temp": "20-32°C",
                "description": "Тепло, меньше туристов.",
                "tips": ["Легкие брюки", "Дышащая рубашка", "Сандалии"]
            }
        },
    "Найроби": {
        "Лето": {
            "temp": "20-28°C",
            "description": "Сухой сезон - лучшее время для сафари.",
            "tips": ["Камуфляжная одежда", "Бинокль", "Репеллент"]
        }
    },
# Африка ЮАР
    "Кейптаун (ЮАР)": {
            "Лето": {
                "temp": "20-28°C",
                "description": "Сухо, ветрено, пляжный сезон.",
                "tips": ["Ветровка", "Купальник", "Солнцезащитный крем"]
            },
            "Зима": {
                "temp": "8-18°C",
                "description": "Дожди, цветение флоры.",
                "tips": ["Дождевик", "Теплый свитер", "Зонт"]
            },
            "Весна": {
                "temp": "12-22°C",
                "description": "Цветение полей, мало туристов.",
                "tips": ["Удобная обувь", "Фотоаппарат", "Легкая куртка"]
            },
            "Осень": {
                "temp": "15-25°C",
                "description": "Тепло, виноградные урожаи.",
                "tips": ["Солнцезащитные очки", "Шляпа", "Джинсы"]
            }
        },
# Африка Танзания
    "Занзибар (Танзания)": {
        "Лето": {
                "temp": "25-32°C",
                "description": "Влажно, возможны дожди (низкий сезон).",
                "tips": ["Репеллент", "Быстросохнущая одежда", "Сланцы"]
            },
        "Зима": {
                "temp": "28-34°C",
                "description": "Сухо, идеально для дайвинга.",
                "tips": ["Купальник", "Солнцезащитный крем", "Шляпа"]
            },
        "Весна": {
                "temp": "26-32°C",
                "description": "Переход к влажному сезону.",
                "tips": ["Зонт", "Легкая рубашка с длинным рукавом", "Очки для плавания"]
            },
        "Осень": {
                "temp": "25-30°C",
                "description": "Теплое море, мало туристов.",
                "tips": ["Пляжный саронг", "Солнцезащитные очки", "Крем от загара"]
            }
        },
# Африка Кения
    "Найроби (Кения)": {
        "Лето": {
                "temp": "20-28°C",
                "description": "Сухой сезон — лучшее время для сафари.",
                "tips": ["Камуфляжная одежда", "Бинокль", "Репеллент"]
        },
        "Зима": {
                "temp": "10-24°C",
                "description": "Короткие дожди, зелень.",
                "tips": ["Ветровка", "Треккинговые ботинки", "Фотоаппарат"]
        },
        "Весна": {
                "temp": "18-26°C",
                "description": "Миграция животных (июль-октябрь).",
                "tips": ["Теплая куртка для утра", "Шляпа", "Пылезащитная маска"]
        },
        "Осень": {
                "temp": "15-25°C",
                "description": "Долгие дожди (апрель-июнь).",
                "tips": ["Дождевик", "Водонепроницаемый рюкзак", "Резиновые сапоги"]
            }
        },
# Африка Египет
    "Каир": {
        "Лето": {
                "temp": "30-40°C",
                "description": "Экстремальная жара, сухо, возможны песчаные бури.",
                "tips": ["Хлопковая одежда", "Головной убор", "Бутылка воды"]
        },
        "Зима": {
                "temp": "10-20°C",
                "description": "Прохладно, идеально для экскурсий к пирамидам.",
                "tips": ["Легкая куртка", "Шарф", "Удобные кроссовки"]
        },
        "Весна": {
                "temp": "18-30°C",
                "description": "Тепло, возможны ветра с песком.",
                "tips": ["Солнцезащитные очки", "Марлевая повязка", "Закрытая обувь"]
        },
        "Осень": {
                "temp": "22-35°C",
                "description": "Жарко, но комфортнее, чем летом.",
                "tips": ["Сандалии", "Солнцезащитный крем", "Легкий шарф"]
        }
        },
    "Хургада": {
        "Лето": {
                "temp": "28-38°C",
                "description": "Очень жарко, сухо, вода в море +30°C.",
                "tips": ["Купальник", "Панама", "Солнцезащитный крем SPF 50+"]
        },
        "Зима": {
                "temp": "15-25°C",
                "description": "Тепло днем, прохладно ночью. Высокий сезон.",
                "tips": ["Легкий свитер", "Шорты", "Солнцезащитные очки"]
        },
        "Весна": {
                "temp": "22-32°C",
                "description": "Идеально для дайвинга, мало туристов.",
                "tips": ["Рубашка с UPF-защитой", "Очки для плавания", "Репеллент"]
        },
        "Осень": {
                "temp": "25-35°C",
                "description": "Теплое море, вечерний ветерок.",
                "tips": ["Пляжная накидка", "Шлепанцы", "Водонепроницаемый чехол для телефона"]
            }
        },
    "Шарм-эль-Шейх": {
        "Лето": {
                "temp": "30-40°C",
                "description": "Палящее солнце, вода +28°C. Низкий сезон.",
                "tips": ["Зонт от солнца", "Увлажняющий крем", "Легкая туника"]
        },
        "Зима": {
                "temp": "18-26°C",
                "description": "Комфортно, море +22°C. Пик туристов.",
                "tips": ["Кардиган для вечера", "Крем после загара", "Маска для снорклинга"]
        },
        "Весна": {
                "temp": "25-33°C",
                "description": "Мало осадков, отличная видимость под водой.",
                "tips": ["Дайвинг-костюм", "Солнцезащитный крем", "Шляпа"]
        },
        "Осень": {
                "temp": "27-36°C",
                "description": "Жарко, но сухо. Бархатный сезон.",
                "tips": ["Солнцезащитные очки", "Пляжный саронг", "Электронный переводчик"]
         }
        },
    "Луксор": {
        "Лето": {
                "temp": "35-45°C",
                "description": "Экстремальная жара, сухо. Экскурсии только утром.",
                "tips": ["Тюрбан", "Термос с водой", "Вентилятор"]
        },
        "Зима": {
                "temp": "12-25°C",
                "description": "Идеально для осмотра храмов и гробниц.",
                "tips": ["Удобная обувь", "Фотоаппарат", "Легкие брюки"]
        },
        "Весна": {
                "temp": "20-35°C",
                "description": "Цветение пальм, комфортные вечера.",
                "tips": ["Солнцезащитный крем", "Шляпа", "Путеводитель"]
        },
        "Осень": {
                "temp": "25-38°C",
                "description": "Жарко, но менее экстремально, чем летом.",
                "tips": ["Зонт от солнца", "Влажные салфетки", "Легкая рубашка с длинным рукавом"]
        }
        },
    "Александрия": {
        "Лето": {
                "temp": "25-32°C",
                "description": "Влажно, морской бриз. Купальный сезон.",
                "tips": ["Пляжное полотенце", "Солнцезащитные очки", "Шлепанцы"]
            },
        "Зима": {
                "temp": "10-18°C",
                "description": "Прохладно, возможны дожди.",
                "tips": ["Джинсы", "Ветровка", "Зонт"]
        },
        "Весна": {
                "temp": "15-25°C",
                "description": "Цветение в парках, приятные прогулки.",
                "tips": ["Легкий свитер", "Кроссовки", "Фотоаппарат"]
        },
        "Осень": {
                "temp": "20-28°C",
                "description": "Тепло, море +24°C. Мало туристов.",
                "tips": ["Кардиган", "Шарф", "Книга для чтения на пляже"]
        }
        },
    "Дахаб": {
        "Лето": {
                "temp": "30-38°C",
                "description": "Сухо, ветрено. Идеально для кайтсерфинга.",
                "tips": ["Солнцезащитный крем для водных видов спорта", "Шорты-рашгард", "Очки от ветра"]
        },
        "Зима": {
                "temp": "15-24°C",
                "description": "Тепло днем, прохладно ночью. Сезон дайвинга.",
                "tips": ["Гидрокостюм", "Толстовка", "Фонарик для ночных прогулок"]
        }
    },


    # Северная Америка
    "Нью-Йорк": {
        "Зима": {
            "temp": "-3 - +5°C",
            "description": "Холодно, возможен снег. Рождественская атмосфера.",
            "tips": ["Теплая куртка", "Шапка", "Водонепроницаемая обувь"]
        }
    },
    "Лос-Анджелес": {
        "Лето": {
            "temp": "20-30°C",
            "description": "Тепло и сухо. Идеально для пляжей.",
            "tips": ["Солнцезащитный крем", "Шляпа", "Купальник"]
        }
    }
}

Cities = {
      "Турция": ["Стамбул", "Анталия", "Бодрум", "Каппадокия"],
      "Египет": ["Каир", "Хургада", "Шарм-эль-Шейх",  "Луксор"],
      "Италия": ["Рим", "Милан", "Венеция", "Флоренция"],
      "Таиланд": ["Бангкок", "Пхукет", "Чиангмай", "Паттайя"],
      "Франция": ["Париж", "Ницца", "Лион", "Марсель"],
      "Испания": ["Барселона", "Мадрид", "Севилья", "Валенсия"],
      "Греция": ["Афины", "Санторини", "Миконос", "Салоники"],
      "Германия": ["Берлин", "Мюнхен", "Гамбург", "Франкфурт"],
      "ОАЭ": ["Дубай", "Абу-Даби", "Шарджа"],
      "Вьетнам": ["Ханой", "Хошимин", "Дананг", "Нячанг"]
    }

